Updated pooling kernel documentation
